package com.example.horoscopes

import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle

class MainActivity : AppCompatActivity() {
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)

        val sisa = 123
        val negra = 1283


        val valera = "Леша" // AHAAHAHAHAHAAHAAHAHAHAAHGAHAHHAAHHAAHап

        var varolant = false
//        ⠄⠄⠄⠄⠄⠄⠄⠄⠄⣠⠤⠖⠚⢉⣩⣭⡭⠛⠓⠲⠦⣄⡀⠄⠄⠄⠄⠄
//        ⠄⠄⠄⠄⠄⠄⢀⡴⠋⠁⠄⠄⠊⠄⠄⠄⠄⠄⠄⠄⠄⠄⠉⠳⢦⡀⠄⠄
//        ⠄⠄⠄⠄⢀⡴⠃⢀⡴⢳⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠙⣆⠄
//        ⠄⠄⠄⠄⡾⠁⣠⠋⠄⠈⢧⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⢧
//        ⠄⠄⠄⣸⠁⢰⠃⠄⠄⠄⠈⢣⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈
//        ⠄⠄⠄⡇⠄⡾⡀⠄⠄⠄⠄⣀⣹⣆⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄
//        ⠄⠄⢸⠃⢀⣇⡈⠄⠄⠄⠄⠄⠄⢀⡑⢄⡀⢀⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄
//        ⠄⠄⢸⠄⢻⡟⡻⢶⡆⠄⠄⠄⠄⡼⠟⡳⢿⣦⡑⢄⠄⠄⠄⠄⠄⠄⠄⠄
//        ⠄⠄⣸⠄⢸⠃⡇⢀⠇⠄⠄⠄⠄⠄⡼⠄⠄⠈⣿⡗⠂⠄⠄⠄⠄⠄⠄⠄
//        ⠄⠄⡏⠄⣼⠄⢳⠊⠄⠄⠄⠄⠄⠄⠱⣀⣀⠔⣸⠁⠄⠄⠄⠄⠄⠄⠄⢠
//        ⠄⠄⡇⢀⡇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠠⠄⡇⠄⠄⠄⠄⠄⠄⠄⠄⢸
//        ⠄⢸⠃⠘⡇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢸⠁⠄⠄⢀⠄⠄⠄⠄⠄⣾
//        ⠄⣸⠄⠄⠹⡄⠄⠄⠈⠁⠄⠄⠄⠄⠄⠄⠄⡞⠄⠄⠄⠸⠄⠄⠄⠄⠄⡇
//        ⠄⡏⠄⠄⠄⠙⣆⠄⠄⠄⠄⠄⠄⠄⢀⣠⢶⡇⠄⠄⢰⡀⠄⠄⠄⠄⠄⡇
//        ⢰⠇⡄⠄⠄⠄⡿⢣⣀⣀⣀⡤⠴⡞⠉⠄⢸⠄⠄⠄⣿⡇⠄⠄⠄⠄⠄⣧
//        ⣸⠄⡇⠄⠄⠄⠄⠄⠄⠉⠄⠄⠄⢹⠄⠄⢸⠄⠄⢀⣿⠇⠄⠄⠄⠁⠄⢸
//        ⣿⠄⡇⠄⠄⠄⠄⠄⢀⡤⠤⠶⠶⠾⠤⠄⢸⠄⡀⠸⣿⣀⠄⠄⠄⠄⠄⠈
//        ⡇⠄⡇⠄⠄⡀⠄⡴⠋⠄⠄⠄⠄⠄⠄⠄⠸⡌⣵⡀⢳⡇⠄⠄⠄⠄⠄⠄
//        ⡇⠄⠇⠄⠄⡇⡸⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠙⠮⢧⣀⣻⢂⠄⠄⠄⠄⠄
//        ⣇⠄⢠⠄⠄⢳⠇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⡎⣆⠄⠄⠄⠄
//        ⢻⠄⠈⠰⠄⢸⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠰⠘⢮⣧⡀⠄⠄
//        ⠸⡆⠄⠄⠇⣾⠄⠄⠄⠄⠄⠄⠄⠄⠄⢠⠆⠄⠄⠄⠄⠄⠄⠄⠙⠳⣄⡀⢢⡀


        // слышь мартышка лысая кишка, сделай мне торпеду, никоток раскрыл копилку епта светит свтиле цш9у-Й4Ц9
    }
}